# DataFrame

In [1]:
import pandas as pd
import numpy  as np

In [2]:
data = {"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
       "score":[90,80,85,75,95,60,65],      
       "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
       "sex":["M","M","M","M","F","F","F"]}

In [3]:
type(data)

dict

In [4]:
df=pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [5]:
df.head()

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M
3  John     75   Swimming   M
4  Alex     95     Tennis   F

In [6]:
df=pd.DataFrame(data,columns=["name","sport","sex","score"])
df

      name      sport sex  score
0     Bill  Wrestling   M     90
1      Tom   Football   M     80
2      Tim     Skiing   M     85
3     John   Swimming   M     75
4     Alex     Tennis   F     95
5  Vanessa     Karete   F     60
6     Kate    Surfing   F     65

In [7]:
df["sport"]

0    Wrestling
1     Football
2       Skiing
3     Swimming
4       Tennis
5       Karete
6      Surfing
Name: sport, dtype: object

In [9]:
df[["name","sport"]]

# select name, sport from table;

      name      sport  score
0     Bill  Wrestling     90
1      Tom   Football     80
2      Tim     Skiing     85
3     John   Swimming     75
4     Alex     Tennis     95
5  Vanessa     Karete     60
6     Kate    Surfing     65

In [10]:
df["age"]=18
df.head()

   name      sport sex  score  age
0  Bill  Wrestling   M     90   18
1   Tom   Football   M     80   18
2   Tim     Skiing   M     85   18
3  John   Swimming   M     75   18
4  Alex     Tennis   F     95   18

In [11]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"], 
                index=["one","two","three","four","five","six","seven"])


values=[18,19,20,18,17,17,18]
df["age"]=values
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   19
three      Tim     Skiing    NaN     85   20
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   17
six    Vanessa     Karete    NaN     60   17
seven     Kate    Surfing    NaN     65   18

In [12]:
df[df.score>=70]

       name      sport gender  score  age
one    Bill  Wrestling    NaN     90   18
two     Tom   Football    NaN     80   19
three   Tim     Skiing    NaN     85   20
four   John   Swimming    NaN     75   18
five   Alex     Tennis    NaN     95   17

In [13]:
df.score>=70

one       True
two       True
three     True
four      True
five      True
six      False
seven    False
Name: score, dtype: bool

In [14]:
df["pass"] = df.score>=70
df

          name      sport gender  score  age   pass
one       Bill  Wrestling    NaN     90   18   True
two        Tom   Football    NaN     80   19   True
three      Tim     Skiing    NaN     85   20   True
four      John   Swimming    NaN     75   18   True
five      Alex     Tennis    NaN     95   17   True
six    Vanessa     Karete    NaN     60   17  False
seven     Kate    Surfing    NaN     65   18  False

In [15]:
np.where(df["pass"]==True, "YES", "NO")

array(['YES', 'YES', 'YES', 'YES', 'YES', 'NO', 'NO'], dtype='<U3')

In [17]:
df.head()

       name      sport gender  score  age  pass
one    Bill  Wrestling    NaN     90   18  True
two     Tom   Football    NaN     80   19  True
three   Tim     Skiing    NaN     85   20  True
four   John   Swimming    NaN     75   18  True
five   Alex     Tennis    NaN     95   17  True

In [18]:
del df["pass"]
df.head()

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   19
three      Tim     Skiing    NaN     85   20
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   17
six    Vanessa     Karete    NaN     60   17
seven     Kate    Surfing    NaN     65   18

In [19]:
# -----TILL this -- 5th July
# Will continue from 6th

In [ ]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"], 
                index=["one","two","three","four","five","six","seven"])


values=[18,19,20,18,17,17,18]
df["age"]=values
df

df.head()

In [ ]:
df.reset_index(drop = True, inplace=True)

In [ ]:
df.head()

In [ ]:
df.set_index("name")

In [ ]:
df.reset_index(inplace = True)

In [ ]:
df.head()

In [ ]:
scores={"Math":{"A":85,"B":90,"C":95}, "Physics":{"A":90,"B":80,"C":75}}
type(scores)

In [ ]:
scores_df=pd.DataFrame(scores)
scores_df

In [ ]:
scores_df.T

In [ ]:
scores_df.values

In [ ]:
scores_index=scores_df.index

In [ ]:
scores_index[1]